<?php

// Задание
// Дан массив [[399, 9160, 144, 3230, 407, 8875, 1597, 9835], 
// [2093, 3279, 21, 9038, 918, 9238, 2592, 7467], 
// [3531, 1597, 3225, 153, 9970, 2937, 8, 807], 
// [7010, 662, 6005, 4181, 3, 4606, 5, 3980], 
// [6367, 2098, 89, 13, 337, 9196, 9950, 5424], 
// [7204, 9393, 7149, 8, 89, 6765, 8579, 55], 
// [1597, 4360, 8625, 34, 4409, 8034, 2584, 2], 
// [920, 3172, 2400, 2326, 3413, 4756, 6453, 8], 
// [4914, 21, 4923, 4012, 7960, 2254, 4448, 1]]. 
// Среди его ячеек некоторые числа являются числами 
// Фибоначчи (числами, участвующими в последовательности Фибоначчи: 1, 1, 2, 3, 5, 8, 13, 21). 
// Найдите сумму чисел Фибоначчи в этом массиве.

// Входные данные
$numberArrays = array(
  array(399, 9160, 144, 3230, 407, 8875, 1597, 9835),
  array(2093, 3279, 21, 9038, 918, 9238, 2592, 7467),
  array(3531, 1597, 3225, 153, 9970, 2937, 8, 807),
  array(7010, 662, 6005, 4181, 3, 4606, 5, 3980),
  array(6367, 2098, 89, 13, 337, 9196, 9950, 5424),
  array(7204, 9393, 7149, 8, 89, 6765, 8579, 55),
  array(1597, 4360, 8625, 34, 4409, 8034, 2584, 2),
  array(920, 3172, 2400, 2326, 3413, 4756, 6453, 8),
  array(4914, 21, 4923, 4012, 7960, 2254, 4448, 1)
);

// Узнаем до каких чисел генерировать числа Фибоначчи
foreach ($numberArrays as $numberArray) {
  $maxNumberArray = max($numberArray);
  if ($maxNumberArray > $max) $max = $maxNumberArray;
}

$fibonacci = array(1);

// Сгенерировать числа Фибоначчи
for ($i = 1, $value = 1; $value < $max; $i++) {
  array_push($fibonacci, $value);
  $value = $fibonacci[$i] + $fibonacci[$i - 1];
}

// Результат
foreach ($numberArrays as $numberArray) {
  $sum_total += array_reduce($numberArray, function ($sum, $value) use ($fibonacci) {
    if (in_array($value, $fibonacci)) return $sum += $value;
    return $sum;
  }, 0);
}

echo $sum_total;
